# Pandas

Used for a multiple of functions used for data cleaning and formatting

# Series

Series is built on top of a Numpy array object
What's the difference?
Series can have access labels i.e index can be labels

In [4]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [3]:
d

{'a': 10, 'b': 20, 'c': 30}

pd.series(data,index)

In [5]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

pd.Series(numpy_array)

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(d) # Sets the index of the dictionary as the labels of the Series and the values will be the values

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data = [sum,print,len]) # Hosts the references the functions

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4], ['USA','Germany','USSR','Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [14]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [17]:
ser1['USA'] # To get a value from the Series # dtype: object indicates the values is a STRING

1

In [19]:
ser1+ser2 # Where it cannot a match, it puts NaN for the values  # The answers in converted into floats

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes

In [2]:
from numpy.random import randn

In [5]:
np.random.seed(101) # This is done to get the same set of random numbers

df = pd.DataFrame(data,index,columns)

In [6]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

DataFrame is a collection of Series that use the same index

In [26]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [28]:
df.W # Do not use

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df[['W','X']] # To get multiple columns, return a list of the columns ; # It returns a dataframe

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [33]:
df['new'] = df['W'] + df['Y']

In [34]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Axis = 0 refers to Index Axis = 1 will refer to columns

The following line does not change the original dataframe. So to completely remove you have to use inplace = True

In [36]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df.drop('new',axis = 1,inplace=True)

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.drop('E') # To drop a row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [44]:
np.shape(df)

(5, 4)

The above operation returns a tuple of the no.of rows followed by the no.of columns. Therefore, axis=0 refers to the rows and axis =1 refers to the columns

# Selecting rows

In [45]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [48]:
df.iloc[0,:]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [50]:
df.iloc[0:2,1:3] # iloc[row,columns]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

# Conditional Selection

In [9]:
df > 0 # Returns places where the condition is True and False

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [10]:
booldf = df > 0

In [11]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
df[df>0] # Returns values where the values are True while NaN for values in False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df['W'] > 0 # Returns a series

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [22]:
df[df['W'] > 0] # Does not return rows where the answer is False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df[df['W'] > 0] [['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [31]:
df[(df['W'] > 0) & (df['Y'] > 1)]  # And Operation

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

'and' can only be used to compare one set of boolean values. To compare a series of boolean values, we need to use '&'

In [32]:
df[(df['W'] > 0) | (df['Y'] > 1)] # Or operation

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Indexing

To reset the index and puts the original index as a new column

In [34]:
df.reset_index() # To make changes to the original dataframe, use inplace = True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [35]:
newind = 'CA NY WY OR CO'.split()

In [36]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [37]:
df['States'] = newind

In [38]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

To make any column as the index, use set_index()

In [40]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Multi Indexed Dataframes and Index Hierarchy

In [47]:
outside = "G1 G1 G1 G2 G2 G2".split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

zip -> Create a tuple of the lists given inside.

In [48]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [49]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])

In [50]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

To change indices, use df.index.names

In [54]:
df.index.names = ['Groups','num']

In [55]:
df

                   A         B
Groups num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646